//패키지
//임포트
/**
 * 클래스명 : 
 * 프로그램명 :
 * 작성일시 :
 * 작성자 :
 * 요청자(분석설계자) :
 * 요청일시 :
 * 요구사항 :
 * @author MULTICAMPUS
 *
 */
public class BeginJava {//클래스명 : 클래스명은 파일명과 같아야 한다. -> 메인클래스를 포함한 클래스
	/*
	 * 메소드명 :
	 * 설명 :
	 * 작성자 :
	 * 작성일시 :
	 * 요청자 :
	 * 요청일시 :
	 * 파라미터 : //입력값
	 * 리턴 타입: //출력값
	 */
	public static void main(String[] args) {// Starting Point : 메인 클래스
		//자바는 공백과 주석이 무한히 허용
		
	}//end of main
}//end of class
//단락이 끝나는 지점에 주석처리해두면 가독성이 좋아진다.



//Naming Rule
//class
//		* 대문자(첫문자, 이어지는 단어의 첫 문자. 나머지는 대문자)
//		- 특수문자 $(inner class 자동) _(jsp를 servlert으로 변환시 사용) 가능, 나머지 불가//하지만 추천하지 않음
//		- 숫자 가능 (맨 앞은 불가)
//variable/method
//		* 첫 문자 소문자, 이어지는 단어의 첫문자 대문자, 나머진 소문자
//		- 숫자 가능 (맨 앞은 불가)
//상수(constant)
//		- 모두 대문자, 단어가 이어질 때는 
//		- 